{
    "version": "https://jsonfeed.org/version/1",
    "title": "Satya Knowledge",
    "description": "",
    "home_page_url": "http://www.satyaknowledge.com",
    "feed_url": "http://www.satyaknowledge.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Narender Singh"
    },
    "items": [
        {
            "id": "http://www.satyaknowledge.com/is-science-an-enemy-of-nature.html",
            "url": "http://www.satyaknowledge.com/is-science-an-enemy-of-nature.html",
            "title": "Is science an enemy of nature?",
            "summary": "Our civilization, as each of us is uncomfortably aware, is passing through a time of crisis. Why should this be? What are the causes of our present troubles? They are all due, in the last resort to the fact that science has been applied to&hellip;",
            "content_html": "Our civilization, as each of us is uncomfortably aware, is passing through a time of crisis. Why should this be? What are the causes of our present troubles? They are all due, in the last resort to the fact that science has been applied to human affairs, but not applied adequately or consistently.<br><br>In the past, man's worst enemy was Nature. He lived under the continual threat of famine and pestilence! a hot summer could bring death to whole nations, and every winter was a menace. Mountains stood like a barrier between people and people a sea was less a highway than an impassable division. Today, Nature, though still an enemy, is an enemy almost completely conquered.<br><br>Our present troubles are not due to Nature. They are entirely artificial, genuinely homemade. The very arts and sciences which we have used to conquer Nature have turned on their creators and are now conquering us. <br><br>The present crisis is of our own making. We have brought it on ourselves by allowing our mechanical and agricultural science to develop more rapidly than our economic science. We cannot buy what we produce and are, therefore, compelled to keep our factories idle. Millions are hungry, but Wheat has to be thrown into the sea. This is where, at the moment, science has brought us. <br>\n<h3 id=\"mcetoc_1e9iogmop0\">What is the remedy?</h3>\n<p> </p>\nSome thinkers tell us that we must return to Nature-mother words, abandon science altogether and live like primitives. The trouble with this advice is that it cannot be followed. No, back to Nature is not practical politics. The only cure for science is more science, not less. We are suffering from the effects of a little science badly applied. The remedy is a lot of science, well applied.",
            "image": "http://www.satyaknowledge.com/media/posts/31/images.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-05-30T17:55:51+05:30",
            "date_modified": "2020-05-30T17:55:51+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/we-must-struggle.html",
            "url": "http://www.satyaknowledge.com/we-must-struggle.html",
            "title": "We must Struggle | Are you Struggling?",
            "summary": "We test the purity of gold by touching it on a touchstone; similarly, the great qualities of mind and heart are tested on the touchstones of adversities, calamities, the slings and arrows of an outrageous fortune.\" Shakespeare's heroes no more remain, heroes, if all struggle&hellip;",
            "content_html": "We test the purity of gold by touching it on a touchstone; similarly, the great qualities of mind and heart are tested on the touchstones of adversities, calamities, the slings and arrows of an outrageous fortune.\" Shakespeare's heroes no more remain, heroes, if all struggle that they put in against adverse forces which are too much for them is taken out of their lives. <br><br>There would have been no Hamlet if he had all the comforts and luxuries and all that riches could give. He was raised to the stature that he displayed because of the great qualities of mind and heart that were duly tested in the fire of calamity. <br><br>If all of us lead easy and normal lives, there would be no romance left in life, our great qualities would not shine, they would rust out and as Dickens said, \"Much better to wear out than rust out. Much better to die doing.\" This is what makes a difference between man and man. <br><br>Countless human beings have been born and died on this earth but except a few all rusted out, no one knows about them. They were not known beyond the circle of their friends and relatives. No poems were written in praise of them and when they died their dirges might have been sung but they did not catch the ear of people beyond a certain distance. <br><br>Only those who have had to face the hard side of life have shown and lighted the path to others. They are a beacon light to others. If we have real grit and girth let not words proclaim them, let the fire of calamity test them. If we succumb to the first onslaught of an outrageous fortune or cry or whine on its approach, then certainly we are no better than ordinary mortals. If we welcome these unwelcome forces, struggle against, and overcome them then really we have something of value which we can be proud of.",
            "image": "http://www.satyaknowledge.com/media/posts/30/rock-ball-struggle.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-04-28T13:26:10+05:30",
            "date_modified": "2020-04-28T13:26:10+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/history-behind-madrassah.html",
            "url": "http://www.satyaknowledge.com/history-behind-madrassah.html",
            "title": "History Behind Madrassah - Islamic education",
            "summary": "Islamic education arrived in India much before Aurangzeb's time, fully grown in concept, context, and functioning. It had its beginning in mektabs, the Arabic term for school. Though there is no indication as to where they were first established, mektabs were certainly widespread by the&hellip;",
            "content_html": "<p>Islamic education arrived in India much before Aurangzeb's time, fully grown in concept, context, and functioning. It had its beginning in mektabs, the Arabic term for school. Though there is no indication as to where they were first established, mektabs were certainly widespread by the fourteenth century AD in capital cities like Samarkand. They were to be the foundation upon which the concept of madrassas, established by the rulers, would rest.</p>\n<h3 id=\"mcetoc_1e60fti6c1\">Madrassah</h3>\n<p><br>The word madrassah comes from the Arabic word dras which means learning. The madrassah is, therefore, the place of learning and the mudaris is the person who imparts this learning. One of the earliest madrassahs had its beginning in the ninth century near the Jama Masjid in Old Delhi-a strong and massive building-followed by some thousand more in Delhi alone. The fourteenth-century Madrassah Firoziyah still stands today, although in ruins, in the lovely setting of the Hauz Khas Tank, Famous teachers such as Sheikh Rumi and Sheikh Jamal-al-Hussaini brought fame to the madrassahs by their erudition.<br><br>Madrassas evolved in three stages. There were at first only Arabic studies at mosques. The masjid was effectively the instructional center where, quite naturally, the recitation of the Holy Koran was the main concern. This stage was followed by the complex becoming the masjidi khan or the lodging place. It was not so much a Sarai or dera for travelers but a resting place for scholars and teachers who had reason to come here from other towns. <br><br>The madrassah proper was a combination of the two stages. The center as a place of learning was now an established concept. Pupils sat at the feet of famous scholars and listened to them. The apprentice or muid was an unquestioning repeater of the Word. He would either learn from the mudaris or the ifada, a person qualified to teach the Master's Word. <br><br>The architectural style of the madrassah developed along with functional concepts that remain valid to this day. Naturally, the style was closely linked to that of the mosque. They were never remote places of quiet learning but were instead almost always built-in busy market places. They formed centers of influence on the community they were set to serve.<br><br>The focal point of a madrassah in the mosque. Around a large courtyard centered by a pool, the three sides, usually double-storeyed, had long, cool arched arcades with deep recesses for classrooms or darskhanas.<br><br>A new feature was a high vaulted, open hall called the iwan which served as the 9 meeting place. On the first floor, repeating the structure of the ground floor were cells or hudira where the students lived. Simple furniture comprising long, low benches to place the books of the study were the only decor. The floor covering was equally basic. The madrassahs set before themselves the simplest tasks. Their aims were direct so as to produce a true believer. <br><br>To this day the direction remains unchanged whether it is in the famous madrasa at Azamgarh in Uttar Pradesh or the more modestly placed Madrasa Aminia at Kashmiri Gate in Delhi. The concept of a true believer has come to be understood not in terms of a repetition of litany but a human being who will live according to the precepts of Islamic values. Such values, truly understood, do not lead the student into a rabid and unbending approach. <br><br>Rather, they help him relate to significant cardinal points and to live by an acceptable code of conduct. Relevant to such exposure and imbibing of moral values are the attitudes that people later bring to their professional lives. When the students reach the point of optimum growth in their learning process and cannot meet the high standards of academics, they stream out into different professions. <br><br>Significantly, most of the pupils are from very low-income groups and will return to become artisans, leather-workers, tailors, or indeed any such simple jobs available. To these professions, they will add a pride of skill and lend to their demeanor a dignity of behavior. This is the tehzeeb which is a direct benefit of his years spent at the madrassah. This is not to say that misbehavior is absent. <br><br>However, the exposure to the madrassah, which channelizes its pupils to live according to certain principled structures, can prove to be an important asset. Unfortunately, the madrassahs do not provide any vocational training which can help the youth earn a livelihood. No amount of moral perfection can replace a solid foundation of a craft. <br><br>This question has not been suitably dealt with by any of the heads of the madrassahs although change along such lines would be relevant in the modern context.</p>",
            "image": "http://www.satyaknowledge.com/media/posts/29/Islamic-education.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-04-16T08:48:00+05:30",
            "date_modified": "2020-04-16T08:49:19+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/tundra-region-climate-facts.html",
            "url": "http://www.satyaknowledge.com/tundra-region-climate-facts.html",
            "title": "Tundra Region - Climate, Facts and Information",
            "summary": "Countries near the Equator are much warmer than countries further to the north or south. We all know that Kerala is much warmer than Punjab in winter. Why? For the same reason, Italy is cooler than India, while England is cooler than Italy. Let us&hellip;",
            "content_html": "Countries near the Equator are much warmer than countries further to the north or south. We all know that Kerala is much warmer than Punjab in winter. Why? For the same reason, Italy is cooler than India, while England is cooler than Italy. <br><br>Let us remember this simple weather fact. \"The further we travel from the Equator, the colder the climate, we get. And when we travel north or south as far as we can go and reach the North or the South Pole, we find ourselves in a strange white world of snow. These are the Polar Regions where no one lives and nothing grows. Why? <br><br>Look at the map of the world. One of the lines about which we have already learned something is called the Arctic Circle. Every place to the north of this line has at least one complete period of 24 hours darkness every year. The coldest places in the world are generally between the Arctic Circle and the North Pole. But as the Arctic Circle is merely a line drawn on maps and globes, there is no sudden change on the surface of the earth itself. <br><br>The same cold climate carries for some distance south. This very cold region lying around the Arctic Circle is called the Tundra Region. Here the winters are long, cold and dreary while the summers are short and cool. The sun is warm enough in summer to melt part of the ice and snow, making growth possible. Clumps of tough, wiry grass and small, stunted trees grow in most parts. Large trees cannot grow as the long roots can not push their way through the frozen ground (Permafrost) which lies 45-60 cm below the surface. <br><br>Flowerless plants called lichens are common. As these plants need only moisture and as they have no roots, they grow even on frozen surfaces completely covered with snow. Some people in Iceland make bread from lichen moss while reindeer moss (another lichen) forms the principal food for that very useful Tundra animal--the Reindeer. <br><br>In sheltered parts of the Tundra Alaska, Iceland, Greenland, and Lapland-wild flowers and many kinds of berries grow during the short summer months. But, on the whole, the Tundra is a cold bleak region where human life is very difficult.<br><br>The Eskimos, numbering about 30,000 are a hardy race living in the Tundra region of Northern Canada, Alaska and Greenland. We often read that Eskimos live in snow houses called igloos but this is not altogether correct. Only about one-third of them use igloos while the majority live in pucca houses built of logs of wood or even stone. <br><br>In summer, they live in skin tents which can be carried easily from place to place. Because of the bitter cold, the Eskimos need plenty of heat-giving food and this they find in plenty in their barren land. Their main supply comes from the seal, which strangely enough, is not a fish but an animal that has to breathe like our horses and cows. <br><br>Since the sea is frequently frozen, the seal has to make a \"breathing hole in the ice and keep it open by swimming round and round. The Eskimo fishermen wait patiently near those holes for hours and as soon as a seal appears, they throw a harpoon at it. This is a weapon with a sharp point and hooks attached to a strong leather line. <br><br>The point enters the seal's body, the hook prevents the point from coming out while the line gives no chance to the seal to escape beneath the ice. With the same harpoon, the Eskimos also hunt whales and walruses. <br><br>While the flesh and fat of these animals provide food, the bones are used for making useful instruments such as the sharp harpoon points, hooks, needles, and ornaments. Besides sea animals, the Eskimos also hunt the savage polar bear and large hairy caribou. <br><br>To add a little variety to his usual meals of fish or meat, the Eskimo gathers tender shoots and such berries as wild currants and blueberries. For clothing, the Eskimos wear waterproof shirts made of seals' intestines, thick fur coats and trousers, furry head hoods and waterproof sealskin boots. All articles of clothing are made by the women-folk.<br><br>On the snow-covered land or frozen water, the Eskimos or frozen water, the Eskimos travel on sleds dragged by five, seven or nine strong dogs called huskies.",
            "image": "http://www.satyaknowledge.com/media/posts/28/tundra-region-facts.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-30T10:20:00+05:30",
            "date_modified": "2020-03-30T10:20:00+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/the-art-of-success.html",
            "url": "http://www.satyaknowledge.com/the-art-of-success.html",
            "title": "The art of Success - Do you want to win?",
            "summary": "What is it that enables some people to gain whatever goal they set for themselves while others do not succeed? What makes some men winners in the world and others the losers? If you want to win, we must find the right answer to this&hellip;",
            "content_html": "What is it that enables some people to gain whatever goal they set for themselves while others do not succeed? What makes some men winners in the world and others the losers? If you want to win, we must find the right answer to this very important question. <br><br>Are there certain qualities or techniques which a person can use to achieve success regardless of goal ? <br><br>To confirm this we must carefully study the lives of successful men of the past as well as the present day. No doubt there are certain characteristics that are commonly found among all these great people. But an academic or college education is not necessarily one of them. <br><br>Such an education perhaps could be an asset. But then considering how many of our educated youth are keen to take on a job of clerk and end up their lives as clerks one may even doubt whether the college education is really an asset. <br><br>Let us remember this. College education by itself is neither good nor bad. It all depends on what use you put it to. The important thing is, if you happen to possess it you can use it to advantage. If you do not have it, there is no real cause to worry. Many have succeeded not only in India but also in other industrial advanced countries having attained great success without a college education. <br><br>For instance, Thomas Edison had taken only three months' schooling. The great Abraham Lincoln was practically self-educated. Benjamin Franklin did not attend school at all. The Wright Brothers were not scientists but bicycle mechanics by their basic profession. <br><br>Success also does not necessarily depend upon one's birth, environment, wealth, etc. H.G. Wells was born in poverty and had to fight ill health continually. The study of the great, successful, self-made men all over the world, whether of the past or of the present, spotlights very important common factors. <br><br>They knew how to get along successfully with others. They knew how to sell themselves to strangers and friends, to their employers and employees, to their neighbors, families, in fact to everyone with whom they came into contact daily. They knew how to sell their ideas, knowledge, talent, and service. They knew how to get along with men, influence and motivate them. <br><br>Success depends to a great extent on what you do with your ideas, talents or gifts. Invariably it is not what you know but what you do about what you know. It is not what you have, but what is done about it that spells the difference between success and failure.<br>\n<h2 id=\"mcetoc_1e435dtoo0\">Abstraction/Summary</h2>\n<br>Getting success in life is never an easy task. The lives of great men show us how we can make our lives useful or successful. Education does not seem to have played a great role in making life successful. Again success has nothing to do with high birth or some special environment. <br><br>The most important thing is the human factor. One must know how to get along with others. A successful man is able to communicate his ideas in a way that he can sell them to others. He knows how to influence people and win friends so as to motivate them for a purpose.",
            "image": "http://www.satyaknowledge.com/media/posts/27/the-art-of-success.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-23T13:14:44+05:30",
            "date_modified": "2020-03-23T13:15:00+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/liberals-and-marxists.html",
            "url": "http://www.satyaknowledge.com/liberals-and-marxists.html",
            "title": "Liberals and Marxists - Liberalism And Marxism Politics",
            "summary": "Some political thinkers think that liberty and equality cannot go together. They think that liberty implies the freedom to do what one would like to do. This is true if freedom is interpreted in its absolute sense to mean that every individual shall be free&hellip;",
            "content_html": "<p>Some political thinkers think that liberty and equality cannot go together. They think that liberty implies the freedom to do what one would like to do. This is true if freedom is interpreted in its absolute sense to mean that every individual shall be free according to his opportunities, there will be chaos. It is a lesson of history that whenever people are allowed to do as they wish, the clever and more capable used their freedom to con centrate all wealth and power in themselves to the misery and oppression of the rest.</p>\n<p>Obviously the negative view is described by those who belong to privileged section of community and for this reason, seek to maintain status quo for the sake of their vested interests. They think that equality is unattainable under conditions of such unrestricted freedom. Lord Acton therefore, says, \"The passion of equality made vain the hope of liberty.\"<br><br>The exponents of this view held that liberty is natural, equality is not. Nature itself created differences. For example, some are intellectuals, others are not. Liberty means freedom i.e., no restrictions : equality needs some restrictions. This is against the prin ciple of liberty. The institution of property is a natural institution and therefore, should not be restricted by equality. Perfect equality is only possible when enforced by state. This means the powers of state will increase.</p>\n<p>Excess power of the state is harmful to the liberty of the people. Moreover, state has produced many evils of capitalism. It has encouraged exploitation. It has given protection to the capitalists. Such a state cannot give perfect equality. So, the hope of liberty also vanishes away. The democracy is said to be a system based on liberty and equality. But unfortunately, the democracy is either becoming elites' democracy or dollar democracy. Either this is controlled by the edu cated class or by the capitalist. Presence of elite or capitalist is inequality. Hence liberty and equality appear opposed to each other.</p>\n<p>The liberals as well as Marxists have asserted that liberty and equality are not opposed to each other. Liberty has no meaning if it is not enjoyed by all. All may enjoy liberty only when privileged classes are abolished in the society. In a society of unequal, freedom becomes a farce. What is the use of expression of thought, when some are deprived ? A sound public opinion cannot be formed.</p>\n<p>That is why R.H. Tawney observes that a large measure of equality, as far from being inimical to liberty, is essential to it.\" If there is only liberty, there will be anarchy. The liberty will be exploited for personal profits. Dunham writes, \"A group of men whose social role consists of taking profits from other people's labour can have no profound belief in equality and fraternity as desired ideals.\" Thus liberty needs equality, so that there is no concentration of wealth in one or few hands. The Marxists have gone to the extent of saying that liberty and equality are closely related for a classless society. The liberals think that democracy can never be successful till there is perfect liberty with equality. Laski, a champion of liberalism writes, \"There cannot, in a word, be democratic government without equality and without democratic government there cannot be freedom.\"</p>\n<p>Democracy is based on political equality. Political equality is not possible without social and economic equality. In the absence of social equality, some Social class will dominate politics and in the absence of economic equality those holding the means of production will dominate politics. So in the absence of social economic equality liberty is just a myth. People may enjoy real liberty only where social and economic equality is established. This will make democracy successful. Thus, we find that liberty without equality is meaningless. We may enjoy liberty only when there is perfect equality. If liberty is to be viewed as positive thing then equality is pre-requisite.</p>\n<p>The Marxists clearly stated there is inequality in the society due to the institution of private property. Many contemporary liberal writers expressed the relation between property and equality but Marxists scientifically analysed the question of equality in relation to property. They maintained that a classless society could only be established when private property is abolished. In a classless society one will work according to one's ability and each will get according to one's need.</p>\n<p>The Marxists maintain that social and political equality is a myth without economic equality. In the absence of economic equality those holding the means of production will dominate politics. They refuse that the state can create equality in a class divided society through welfare measures. They believe that social ownership of the means of production in a given society is a precondition for economic equality. The Marxists accept that all distinctions cannot be removed. They say, \"communist equality presupposes the eradication not of all distinctions and such conditions as would give rise to a difference in the social position of people\".</p>",
            "image": "http://www.satyaknowledge.com/media/posts/26/2000px-Forms_of_government.svg.png",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-20T18:09:21+05:30",
            "date_modified": "2020-03-20T18:09:21+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/the-art-of-paying-compliments-real-praise.html",
            "url": "http://www.satyaknowledge.com/the-art-of-paying-compliments-real-praise.html",
            "title": "The art of paying compliments - Real Praise",
            "summary": "Real praise, the sincere compliment is probably the most useful social tool of all. It's the valued gold coin of our conversation. Yet today, it is in danger of losing its brightness. For it is greatly misused and not properly exchanged. What is a true&hellip;",
            "content_html": "Real praise, the sincere compliment is probably the most useful social tool of all. It's the valued gold coin of our conversation. Yet today, it is in danger of losing its brightness. For it is greatly misused and not properly exchanged. What is a true compliment ? It's one that benefits both giver and receiver. Once a painter and his young assistant were painting our house. The older man was wearing shiny new shoes.<br><br>As the man sta: skilfully painting, my father-in-law, said to the boy, \"Son, when you can show up on the job to paint a house, wearing new shoes, you will be the master of your trade.\" The painter smiled and did the best job. We all like to have our sense of personal worth built up or pointed out. And when one expert adds to another's sense of dignity and speaks favourably of his skill, he is offering a compliment of the highest and rarest kind.<br><br>A compliment differs from flattery in that it is objective and given without thought of gain. Flattery is often merely lip service or excessive praise given for motives other than expressed.<br><br>The greatest efforts of the human race have always resulted from the love of praise. This should be inspired in childhood. The wise parent makes it a point to compliment a child who deserves it. A woman I know has a 12 year old son who considers washing dishes for his mother a great honour. One night, while washing a large dish, it slipped and crashed on the floor. Then his mother said, \"You know, Robert, of all the times you have washed the dishes for me, this is the first time you dropped one.\" Anxiety left the boy's face and he smiled. As one psychologist advises, \"Praise virtue and you will find few vices to criticise.\"<br>There is an art in this giving of compliments. Thus the good compliment is always to the<br><br>point and timing is important. Don't wait too long to tell a person what a good talk he gave or how well he cut your grass. But don't do it immediately when he is expecting it either. Wait. Then when he thinks you may have forgotten, pass the praise.<br><br>Confidence, it has been said, is the greatest gift that one human can give to another. But that does not mean we should be wasteful with our compliments. Rather we should count them carefully remembering that a good compliment has greater purchasing power than money, that no one is too busy or successful to receive a word of praise.<br>\n<h2 id=\"mcetoc_1e3pd781u0\">Summary</h2>\n<br>A sincere compliment is the most useful social tool. Unfortunately, it is misused and not properly exchanged. A true compliment benefits both, the giver and the receiver. A compliment is different from flattery. It is objective and without any motive. The love of praise has motivated the greatest achievements of human race. If we praise virtue, we will find few vices to criticise. A good compliment is always precise. Timing is also important. We should not be wasteful with our compliments. A good compliment has more purchasing power than money. Everyone desires and loves to have it.",
            "image": "http://www.satyaknowledge.com/media/posts/25/1__3f0rAE9uPUFeQ2WoguQxw.jpeg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-19T18:18:18+05:30",
            "date_modified": "2020-03-19T18:18:18+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/how-does-smoking-affect-your-body.html",
            "url": "http://www.satyaknowledge.com/how-does-smoking-affect-your-body.html",
            "title": "How does smoking affect your body?",
            "summary": "Smoking is the major cause of mortality with bronchogenic carcinoma of the lung and is one of the factors causing death due to malignancies of the larynx, oral cavity, esophagus, bladder, kidney, pancreas, stomach, and uterine cervix and coronary heart diseases. Nicotine is the major&hellip;",
            "content_html": "Smoking is the major cause of mortality with bronchogenic carcinoma of the lung and is one of the factors causing death due to malignancies of the larynx, oral cavity, esophagus, bladder, kidney, pancreas, stomach, and uterine cervix and coronary heart diseases. <br><br>Nicotine is the major substance present in the smoke that causes physical dependence. The additives do produce damage to the body - for example, ammonia can result in a 100-fold increase in the ability of nicotine to enter into the smoke. <br><br>Levulinic acid, added to cigarettes to mask the harsh taste of the nicotine, can increase the binding of nicotine to brain receptors, which increases the 'kick' of nicotine. Smoke from the burning end of a cigarette contains over 4000 chemicals and 40 carcinogens. It has long been known that tobacco smoke is carcinogenic or cancer-causing.<br><br>The lungs of smokers collect an annual deposit of 1 to 10 pounds of the gooey black material. The invisible gas phase of cigarette smoke contains nitrogen, oxygen and toxic gases like carbon monoxide, formaldehyde, acrolein, hydrogen cyanide, and nitrogen oxides. These gases are poisonous and in many cases interfere with the body's ability to transport oxygen.<br><br>Like many carcinogenic compounds, they can act as tumor promoters or tumor initiators by acting directly on the genetic make-up of cells the body leading to the development of cancer.<br><br>During smoking within the first 8 - 10 seconds, nicotine is absorbed through the lungs and quickly moved into the bloodstream and circulated throughout the brain. Nicotine can also enter the bloodstream through the mucous membranes that line the mouth Gif tobacco is chewed) or nose if snuff is used) and even through the skin. <br><br>Our brain is made of billions of nerve cells. They communicate with each other by chemical messengers called neurotransmitters. Nicotine is one of the most powerful nerve poisons and binds stereo-selectively to nicotinic receptors located in the brain, autonomic ganglia, the medulla, neuro-muscular junctions. Located throughout the brain, they play a critical role in cognitive processes and memory.<br><br>The nicotine molecule is shaped like a neurotransmitter called acetylcholine which is involved in many functions including muscle movement, breathing, heart-rate, learning, and memory. Nicotine, because of the similar structure with acetylcholine when it gets into the brain, attaches itself to acetylcholine sites and produces toxic effects. <br><br>In high concentrations, nicotine is more deadly. In fact, one drop of purified nicotine on the tongue will kill a person. It has been used as a pesticide for centuries. Recent research studies suggest that acute nicotine administration would result in increased dopamine release from the brain, producing perceptions of pleasure and happiness, increased energy and motivation, increased alertness, increased feeling of vigor during the early phase of smoking. <br><br>However, notwithstanding these superficial effects, research shows that the relationship between smoking and memory loss is strongest in people who smoke more than 20 cigarettes each day and this is not specific to the socio-economic status, gender and a range of associated medical conditions. Smoking may speed up age-related memory loss and the details are not yet clear. Some studies suggest that repeated exposure to high nicotinic smoke related to the 'Brain-wiring' is nothing but neuro-biochemistry that deals with complex interaction among genetic experience and biochemistry of brain cells<br><br>NO' is a unique molecule that plays a role in a number of beneficial and some of the harmful brain and body mechanisms, for example, synapse formation, drug tolerance and local regulation of cerebral blood flow, Parkinson's disease, etc. It is also found that people who smoke more cigarettes a day have poorer memories in middle age than non-smokers.<br><br>Some experts say that smoking is linked to memory problems because it contributes to narrowed arteries that restrict blood flow to the brain. One of the causes of memory decline in relation to the brain function could be the nerve cell death or decreased density of interconnected neural network due to loss of dendrites, the tiny filaments which connect one nerve cell to another. Abstinence from smoking is essential, not only to avoid this systemic effect but also to reduce the ill-effects on the environment.",
            "image": "http://www.satyaknowledge.com/media/posts/24/smoking-kills.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-13T18:50:21+05:30",
            "date_modified": "2020-03-23T13:15:10+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/egotism-is-the-most-common-fault.html",
            "url": "http://www.satyaknowledge.com/egotism-is-the-most-common-fault.html",
            "title": "Egotism is the most common fault",
            "summary": "Egotism is the most common fault of mankind. Product of the perfectly natural desire to display oneself, egotism, which is an exaggerated form of self-display, can take such a variety of shapes that it is not always easy to discern. Beyond any shadow of a&hellip;",
            "content_html": "Egotism is the most common fault of mankind. Product of the perfectly natural desire to display oneself, egotism, which is an exaggerated form of self-display, can take such a variety of shapes that it is not always easy to discern. <br><br>Beyond any shadow of a doubt, however, it is a personal defect that ought to be constantly hunted down the scotched, for it impairs the personality, and frustrates all efforts at self-improvement.<br><br>This is the easily recognizable form of egotism that is evidenced in the person who continually talks of his own affairs. You must all have met the kind of man who is never happy when recounting his exploits and experiences in life, and whatever subject he may begin discussing you feel quite sure that he will sooner or later arrive at himself. <br><br>Although such a blatant kind of egotism is apparent to the onlooker, it may not be so easy for the egotist himself to recognize his fault. But if he can put on his guard-and it behooves each one of us to examine carefully whether we are entirely immune from this canker-there is always hope of a cure. <br><br>On the other hand, there is a type, not uncommon, which evidences its egotism by affecting a humility that is certainly not felt, and ostentatiously avoiding the use of the pronoun \"I\" in speech and in writing. Such affectation is an infallible sign of egotism, and it is all the more reprehensible because it is deliberately assumed by the person. <br><br>Next, we come to the individual who holds strong opinions and insists on forcing these opinions on to others. He constantly lays down the law, he knows and he jolly well insists that you shall accept his viewpoints. Here again, there is not a great difficulty in recognizing the egotistical aspect of this conduct, although it is not so easy to remove such a defect, for a person of this kind is generally possessed of a fiery temper-but again, it can be done, and recognition of the defect is the first step towards its cure. <br><br>There are two other well-known types of egotists-the over-precise person and the officious one. The former offends by his meticulous habits, his insistence on having everything just right generally connoting the way he personally wants them to be. <br><br>The officious individual succeeds in making himself most disliked because of his detestable habit of always showing or telling other people how to do things. He will glibly appeal to duty: he will continually find fault with another's way of doing things, and point out the immense superiority of his method. In his own eyes, he is always right.<br>\n<h2 id=\"mcetoc_1e3740i680\">SUMMARY</h2>\n<br>Egotism is the commonest fault of mankind. It is an exaggerated form of self meant. An egotist thinks, talks and praises no one but himself. He never recognizes display. It is a personal defect that harms and frustrated all efforts of self-improve his faults. Affectation of humility can be another form of egotism. <br><br>The imposition of his strong opinion is the sign of an egotist. Over-precise and officious persons are two other types of egotists. The first kind of person insists on having everything just right. The second category of people find fault with others and display their superiority over others.",
            "image": "http://www.satyaknowledge.com/media/posts/23/ego-is-the-common-fault.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-12T15:51:52+05:30",
            "date_modified": "2020-03-12T15:51:52+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/how-does-television-affect-our-lives.html",
            "url": "http://www.satyaknowledge.com/how-does-television-affect-our-lives.html",
            "title": "How does television affect our lives? ",
            "summary": "It can be very helpful to people who carefully choose the shows that they watch. Television can increase our knowledge of the outside world; there are high-quality programs that help us understand many fields of study science, medicine, the arts and so on. Moreover, television&hellip;",
            "content_html": "It can be very helpful to people who carefully choose the shows that they watch. Television can increase our knowledge of the outside world; there are high-quality programs that help us understand many fields of study science, medicine, the arts and so on. <br><br>Moreover, television benefits very old people, who can't often leave the house as well as patients in hospitals. It also offers non-native speakers the advantage of daily informal language practice. They can increase their vocabulary and practice listening. On the other hand, there are several serious disadvantages of television. <br><br>Of course, it provides us with a pleasant way to relax and spend our free time, but in some countries. people watch the 'boob-tube' for an average of six hours or more a day. Many children stare at a television screen for more hours each day than they do anything else, including studying and sleeping. It's clear that the tube has a powerful influence on their lives and that its influence is often negative. <br><br>Recent studies show that after only thirty seconds of television, a person's brain relaxes' the same way that it does just before the person falls asleep. Another effect of television on the human brain is that it seems to cause poor concentration. <br><br>Children who view a lot of television can often concentrate on a subject for only fifteen to twenty minutes. They can pay attention only to the amount of time between commercials. <br><br>Another disadvantage is that television often causes people to become dissatisfied with their own lives. Real-life does not seem as exciting to these people as the lives of actors on the screen. To many people, television becomes more real than reality and their own lives seem boring. <br><br>Also, many people get upset or depressed when they can't solve problems in real life as quickly as television actors seem to. Before a child is fourteen years old, he or she views eleven thousand murders on the tube. He or she begins to believe that there is nothing strange about fights, killings and other kinds of violence. <br><br>Many studies show that people become more violent after certain programs. They may even do the things that they saw in a violent show. The most negative effect of the 'boob-tube' might be people's addiction to it. <br><br>People often feel a strange and powerful need to watch television even when they don't enjoy it. Addiction to a television screen is similar to drug or alcohol addiction. People almost never believe they are addicted.<br>\n<h2 id=\"mcetoc_1e34quub40\">Summary</h2>\n<br>Television affects our lives in many ways. It provides knowledge of the outside world. It provides us good programs related to science, medicines, and arts. It entertains the old. But there are several serious disadvantages of television. <br><br>Most people watch TV for 6 hrs. a day. Children watch TV for more hours than they spend on studying and sleeping. Their studies suffer. People remain dissatisfied and life becomes boring. Violence, murders, and fight affect children. People get excited. They get addicted to TV. Its addiction is like drug addiction.",
            "image": "http://www.satyaknowledge.com/media/posts/22/tv.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-11T18:33:10+05:30",
            "date_modified": "2020-03-11T18:33:10+05:30"
        }
    ]
}
