{
    "version": "https://jsonfeed.org/version/1",
    "title": "Satya Knowledge",
    "description": "",
    "home_page_url": "http://www.satyaknowledge.com",
    "feed_url": "http://www.satyaknowledge.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Narender Singh"
    },
    "items": [
        {
            "id": "http://www.satyaknowledge.com/how-does-television-affect-our-lives.html",
            "url": "http://www.satyaknowledge.com/how-does-television-affect-our-lives.html",
            "title": "How does television affect our lives? ",
            "summary": "It can be very helpful to people who carefully choose the shows that they watch. Television can increase our knowledge of the outside world; there are high-quality programs that help us understand many fields of study science, medicine, the arts and so on. Moreover, television&hellip;",
            "content_html": "It can be very helpful to people who carefully choose the shows that they watch. Television can increase our knowledge of the outside world; there are high-quality programs that help us understand many fields of study science, medicine, the arts and so on. <br><br>Moreover, television benefits very old people, who can't often leave the house as well as patients in hospitals. It also offers non-native speakers the advantage of daily informal language practice. They can increase their vocabulary and practice listening. On the other hand, there are several serious disadvantages of television. <br><br>Of course, it provides us with a pleasant way to relax and spend our free time, but in some countries. people watch the 'boob-tube' for an average of six hours or more a day. Many children stare at a television screen for more hours each day than they do anything else, including studying and sleeping. It's clear that the tube has a powerful influence on their lives and that its influence is often negative. <br><br>Recent studies show that after only thirty seconds of television, a person's brain relaxes' the same way that it does just before the person falls asleep. Another effect of television on the human brain is that it seems to cause poor concentration. <br><br>Children who view a lot of television can often concentrate on a subject for only fifteen to twenty minutes. They can pay attention only to the amount of time between commercials. <br><br>Another disadvantage is that television often causes people to become dissatisfied with their own lives. Real-life does not seem as exciting to these people as the lives of actors on the screen. To many people, television becomes more real than reality and their own lives seem boring. <br><br>Also, many people get upset or depressed when they can't solve problems in real life as quickly as television actors seem to. Before a child is fourteen years old, he or she views eleven thousand murders on the tube. He or she begins to believe that there is nothing strange about fights, killings and other kinds of violence. <br><br>Many studies show that people become more violent after certain programs. They may even do the things that they saw in a violent show. The most negative effect of the 'boob-tube' might be people's addiction to it. <br><br>People often feel a strange and powerful need to watch television even when they don't enjoy it. Addiction to a television screen is similar to drug or alcohol addiction. People almost never believe they are addicted.<br>\n<h2 id=\"mcetoc_1e34quub40\">Summary</h2>\n<br>Television affects our lives in many ways. It provides knowledge of the outside world. It provides us good programs related to science, medicines, and arts. It entertains the old. But there are several serious disadvantages of television. <br><br>Most people watch TV for 6 hrs. a day. Children watch TV for more hours than they spend on studying and sleeping. Their studies suffer. People remain dissatisfied and life becomes boring. Violence, murders, and fight affect children. People get excited. They get addicted to TV. Its addiction is like drug addiction.",
            "image": "http://www.satyaknowledge.com/media/posts/22/tv.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-11T18:33:10+05:30",
            "date_modified": "2020-03-11T18:33:10+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/pursuit-of-happiness.html",
            "url": "http://www.satyaknowledge.com/pursuit-of-happiness.html",
            "title": "Pursuit of Happiness - Ultimate Goal",
            "summary": "To date, happiness has defied definition. Most people tend to equate happiness with fun, good living, plenty of money. If happiness were synonymous with all this, rich people with all their luxuries and countless parties would be perpetually happy. But in actual fact, they are,&hellip;",
            "content_html": "To date, happiness has defied definition. Most people tend to equate happiness with fun, good living, plenty of money. If happiness were synonymous with all this, rich people with all their luxuries and countless parties would be perpetually happy. But in actual fact, they are, frequently, acutely unhappy, despite their riches and ability to indulge in fun activities at will. Fun is what we experience during an act; happiness is that intangible something we experience after an act. We may have fun watching a movie, going shopping, meeting friends-these are all fun activities that afford us fleeting moments of relaxation and enjoyment. Happiness, on the other hand, is a much stronger, deeper and more abiding emotion.<br><br>If we perceive happiness as the ultimate goal, we must also devise a way to reach that goal. The way to happiness is not a smooth, broad highway along which we can cruise at a comfortable speed. It is a path through rocky and rugged terrain and the going can become very tough at times. At these times we have to roll up our sleeves and with pitchfork and shovel make our way onwards. This pursuit of happiness lasts a lifetime. Great happiness is earned only by great effort and effort not in spurts but diligent, constant effort. In this connection we are confronted with another fallacy, that fun and pleasure mean happiness and thus pain, its corollary, must be synonymous with unhappiness. But in fact, the truth is quite different. Things that bring us happiness, more often than not, involve some amount of pain. It is because of the misconception that people avoid the very endeavor that is the source of true happiness. Difficult endeavors - such as the raising of children, establishing deeper relationships with loved ones, trying to do something worthwhile in life - hold the promise of a world of happiness.<br>Happiness is not a permanent vacation. Another prevalent belief is that if one were rich enough not to have to work one would be blissfully happy. But a job is more than just a paycheque. Almost all religions teach us that work is worship. Work holds the key to happiness as doing something which increases confidence and self-worth. It brings on a feeling of satisfaction, of doing something, of contributing. Job satisfaction comes less from how much one earns than from the challenge of the job. Of course the pay-cheques count. It would be unrealistic to suggest that one could be happy without basic shelter, roaming the streets on an empty stomach.<br><br>A secret ingredient of happiness is contentment. Contentment here does not mean apathy or lack of ambition, just as commitment does not mean curtailment of freedom. Commitment teaches us to give so that we may receive and contentment helps us to cherish the gifts we have received. These things are worth a try even if they don't promise access to the pinnacle of success. Success, after all, has been described as getting what one wants, whereas happiness is liking what one gets.<br>\n<h2 id=\"mcetoc_1e3252cuo0\">Summary</h2>\n<br>Happiness defies definition. It is not synonymous with fun, good living or wealth. The rich are unhappy in spite of all these things. Fun activities give us only fleeting moments of enjoyment. Happiness, on the other hand, is a deeper and more abiding emotion. The way to happiness is not smooth. We have to make your own way. The pursuit of happiness is a long and lifetime experience. It is a fallacy to equate happiness with fun and pleasure. Work holds the key to happiness. Contentment brings happiness. Success means getting what one wants but happiness is liking what one gets.",
            "image": "http://www.satyaknowledge.com/media/posts/21/hapiness.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-10T17:31:49+05:30",
            "date_modified": "2020-03-10T17:31:49+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/power-of-faith-faith-shakes-mountains.html",
            "url": "http://www.satyaknowledge.com/power-of-faith-faith-shakes-mountains.html",
            "title": "Power of Faith - Faith shakes mountains",
            "summary": "Faith is the helm of human life, which keeps it dynamic and stable even in millions of contrasts, complications. The life of the bond of faith cannot stagger. Many complications, problems, storms, storms also can not distract the person from his mission, who is walking&hellip;",
            "content_html": "Faith is the helm of human life, which keeps it dynamic and stable even in millions of contrasts, complications. The life of the bond of faith cannot stagger. Many complications, problems, storms, storms also can not distract the person from his mission, who is walking with unwavering faith in himself.<br><br>All the lamps which give light in life should be extinguished, but if the light of faith is kept burning inside the human being, it will find its own path even in the darkest darkness. All the darkness of the world disappears in front of the flame of confidence.<br><br>All the great things that have been done in the world are the works of faith. Mahatma Gandhi's strong faith made the dream of independence of the country come true. Tilak ji had said- \"Swarajya is our birthright and we will keep it.\" His conviction later became tangible.<br><br>Lincoln wrote in his diary, and also told the people - \"I have promised my God that I must complete the work of the emancipation of slaves.\" Despite many protests, Lincoln did that great work.<br><br>Columbus believed some cool across the vast ocean. He finally discovered America after his adventurous journey. Faith is the key to a successful life. Tolstoy wrote - \"Faith is the power of life.\" Shakespeare said - what can \"faith\" not do? Faith gives us the strength and motivation to cross the skyscrapers.<br><br>Faith is the basis of all the gifts of life. Swet Marden has written- \"Faith seeks the path of life that can lead us to the destination\". Mahatma Gandhi said- \"Faith also plays our life in the stormy sea.<br><br>Faith shakes mountains. Can transcend the vast ocean. Faith is not a soft flower that falls from the breath of ordinary air. He is immutable like the Himalayas. \"<br><br>Where there is faith, all the lack of life, curse, lowliness, poverty, poverty, and poor feeling become. They do not become an impediment to the development of life. The life of most of the great men of the world proves this fact, who had little support to grow, they achieved great successes in life by their self-help. Many people became extraordinary based on their faith.<br><br>To achieve success in any field, it is necessary to have faith to move forward. If there is no power of faith behind the fulfillment of any goal, then it will be established in its initial period itself. In the absence of faith, human life becomes dry and lifeless. Inertia grabs its net.<br><br>In the absence of faith, even on the Rajpath, a man cannot move forward. Faith is not an object to be found elsewhere or a blessing of one's grace. This is the eternal truth that lies within our space.<br><br>Self-consciousness, Ajar-Akshar, All-powerful, divine form can be the basis of our faith. Man himself is the owner of renewable power and funds. Power is the third source of prosperity in human difference. When it is introduced, conviction arises.",
            "image": "http://www.satyaknowledge.com/media/posts/20/Faith.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-09T17:14:00+05:30",
            "date_modified": "2020-03-09T17:14:00+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/why-satisfaction-is-needed.html",
            "url": "http://www.satyaknowledge.com/why-satisfaction-is-needed.html",
            "title": "Why Satisfaction is needed?",
            "summary": "Man's life is a reflection of his thoughts. Success-failure, progress-decadence, insignificance-greatness, happiness-sorrow, peace, etc. all depend on the thoughts of human beings first. Knowing the thoughts of any person, the map of his life can be easily found out. His thoughts have an important place&hellip;",
            "content_html": "<p>Man's life is a reflection of his thoughts. Success-failure, progress-decadence, insignificance-greatness, happiness-sorrow, peace, etc. all depend on the thoughts of human beings first.<br><br>Knowing the thoughts of any person, the map of his life can be easily found out. His thoughts have an important place in making a man anything cowardly, healthy-unhealthy, happy-unhappy. It means that the life of a human being is formed and worsens according to his thoughts. If good thoughts make it advanced, then inferior thoughts will fall down.<br><br>Swami Ramatirtha has said- \"A man's life is like that.\"</p>\n<p>Swami Vivekananda had said- \"Heaven and hell are nowhere else, they live in our thoughts only.\"</p>\n<p>Lord Buddha, while teaching his disciples, said- \"Monks! Whatever we are in the present, our thoughts are due to us and whatever we become in the future is also due to our thoughts.\"<br><br>Shakespeare wrote - \"Nothing is good or bad. The basis of good and evil is our thoughts.\"<br><br>Jesus said- \"He becomes like a man has thoughts.\"<br><br>The famous Roman philosopher Marcus Aurelius said - \"Whatever our life is, it is the result of our own thoughts.\"<br><br>The famous American writer Dale Carnegie, while revealing the facts based on his experiences, wrote - \"The most important thing I have learned in life is that the power and importance of ideas, the power of ideas is supreme and immense.\"<br><br>In short, our thoughts have a major hand in conducting various activities of life. Whatever we do, we do it with the inspiration of ideas.<br>Variations and oddities seen in the world are also reflections of our thoughts.<br><br>The world is a shadow of human thoughts. For some, the world is heaven, for some, hell. For some, if the world is the face of peace, trouble, pain, etc., for someone, there is a garden full of happiness. Under the same circumstances, there is an extraordinary difference in the difference of opinion between two people with the same prosperity.<br><br>In one life, training experiences happiness, peace, satisfaction, and the other spends life in times of pain, grief. Not only this, many people are happy even after spending a life lacking difficulty, and many consider life to be hellish, even after being prosperous. One person remains contented in his circumstances and thanks God for life, the other remains dissatisfied even after getting many pleasures. Curses others, merely because of their own thoughts.<br><br>The ancient sage-sage Aranyak lived a happy and happy life after eating life of candle fruit and lived in a heavenly feeling on earth. Whereas today, there is a human who is troubled by more tribulation, disturbance, sorrow, ecstasy, even after living a life with ample comfort, prosperity, Aishwarya, scientific means. This is the result of thinking of humans.<br><br>Famous English writer Swart used to mourn each of his birthdays by wearing black and ragged clothes. He used to say- \"I would not have got this life, I would not have come in the world.\"<br><br>In contrast, the blind poet Milton used to say- \"Thank God, who gave me the priceless gift of living\".<br><br>Napoleon Bonaparte said in his last days - \"Sadly, I did not spend a week of my life in peace.\" While there was no shortage of prosperity, opulence, wealth, fame etc.<br><br>Alexander the Great also died in his last life, repenting. The basis of happiness, happiness or sorrow, grief, restlessness, remorse etc. in life are the thoughts of man himself. None other<br><br>Due to wrong thoughts, a person will be sad even in prosperity, opulence, rich life, and will experience happiness, peace and happiness even in a life which is lacking from excellent ideas.</p>",
            "image": "http://www.satyaknowledge.com/media/posts/19/Satisfaction.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-08T14:16:21+05:30",
            "date_modified": "2020-03-08T14:16:21+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/is-it-bad-to-take-a-bribe-or-offering-a-bribe.html",
            "url": "http://www.satyaknowledge.com/is-it-bad-to-take-a-bribe-or-offering-a-bribe.html",
            "title": "Is it bad to take a bribe? Or offering a bribe?",
            "summary": "In a bribery case, two sides are usually involved. One side that bribes and the other one who bribes. Both taking and giving bribes are considered criminal acts, but in this regard it is often considered a matter of dispute that in both the parties&hellip;",
            "content_html": "In a bribery case, two sides are usually involved. One side that bribes and the other one who bribes. Both taking and giving bribes are considered criminal acts, but in this regard it is often considered a matter of dispute that in both the parties related to the act of bribery, who is responsible for this act?<br><br>We should test both sides before making a definite idea in this regard.<br><br>As far as this aspect of the idea is concerned, the responsibility of the bribe-taking party is for the work done in the transaction related to the bribe. The defendants of this party say that the bribe takers are responsible for the origin of the circumstances in which the bribe transaction becomes mandatory and it becomes the compulsion of the bribe givers.<br><br>For example- when a person has to get his work done from a government office like getting a permit or license, getting a house map approved, getting water or electricity connection etc. and when after completing all the work on his behalf as per rules It sees that the concerned file does not bother with the case, then it has to be forced and bribed.<br><br>In many offices, the situation is such that all the bribe money of the entire office is taken in one place and then the necessary work is done easily and the bribe money is distributed among the concerned people.<br><br>The argument given on the basis of this situation implies that the bribe does not want to launder his money as a bribe, but he does so only when the person doing his work does not want to work without bribe. . In this way, the bribe-taking party has the real responsibility for the circulation of the bribe transaction.<br><br>On the contrary, in relation to the party of the idea, the bribe party is responsible for the act of bribery. The proponents of this view say that the people responsible for the origin of the circumstances of the bribe transaction are the people who pay the bribe.<br><br>There are some rules for obtaining permits or licenses, getting a house map approved, obtaining a combination of water or electricity or doing other similar tasks and there is a process of their completion.<br><br>In how many days there should be a work. It is also decided, but despite all this arrangement, some people want to get their work done against the rules or - before the stipulated time and they offer bribe on their behalf, not on anyone's demand for it. , So that their work can be completed despite the rules or their work can be done before the scheduled time.<br><br>There are some such works like - contracts for government works, contracts for the supply of goods, etc., for which the contractor, etc., without any demand, gives a bribe (commission) on his own behalf.<br><br>The argument that is made on the basis of this situation means that the people who actually bribe, to prove their selfishness, make the people of the other party addicted to taking bribe. And on the basis of this reasoning, it is concluded that the actual responsibility of the circulation of the bribe transaction rests with the party paying the bribe.<br><br>But if you look a little thoughtfully, both of the above ideas are one-sided. In fact, for the practice of bribery transactions, only one party who takes or gives bribes cannot be said to be guilty or liable.<br><br>Some of the rules and circumstances of the functioning of the government are such that in which the government officials and employees are in a position to give some convenience or difficulty on their own behalf and due to this, when someone wants that facility from them, then they can pay that facility fee. Taking it as their common right.<br><br>It is therefore necessary that those situations be eliminated in which the bribe taker bribes, and the bribe taker takes the bribe.",
            "image": "http://www.satyaknowledge.com/media/posts/18/bribe.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-05T18:48:27+05:30",
            "date_modified": "2020-03-05T18:48:27+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/bharat-ratna-mokshagundam-visvesvaraya.html",
            "url": "http://www.satyaknowledge.com/bharat-ratna-mokshagundam-visvesvaraya.html",
            "title": "Bharat Ratna Sir Mokshagundam Visvesvaraya - A great Inspiration",
            "summary": "Bharat Ratna Sir Mokshagundam Visvesvaraya was born on 15 September 1861 in the village Madan Halli of Kolar district of Mysore state. His father Pandit Srinivas Shastri was a distinguished scholar, a religious but very poor and ordinary person. He did not have the funds&hellip;",
            "content_html": "<p>Bharat Ratna Sir Mokshagundam Visvesvaraya was born on 15 September 1861 in the village Madan Halli of Kolar district of Mysore state. His father Pandit Srinivas Shastri was a distinguished scholar, a religious but very poor and ordinary person.<br><br>He did not have the funds to teach his son. After studying in the village, he had to go to Bangalore for further education. He used to dine at his maternal uncle's house and pay tuition for a fee. The British Principal of the college, Charles Walters, impressed by his ability, talent and efficiency, got him enrolled in Science College of Poona and got scholarship.<br><br>In this college, he made full use of his time and got the first place in the Engineering Examination of Bombay University in 1883, as a result of which in 1884 he was awarded P.W. D. Appointed to the post of Assistant Engineer in the department. Due to his qualifications, he was about to take the post of Chief Engineer in a short time, but the British engineers opposed the posture of an Indian to the post of Chief Engineer. As a result, he was not made the Chief Engineer.<br><br>During the government service, he built the famous Sakkhar Dam in 1893 and invented the block system of irrigation and automatic sluice gates in 1899, which was praised by well-known politicians like Shri Bal Gangadhar Tilak and Mahadev Govind Ranade etc.<br><br>In 1908, he resigned from the government job. After resigning from a government job, he traveled abroad to see the industries there. In the same period, Nizam Hyderabad called itself to solve the problem of severe floods in his state. He solved the problem of flooding there by building a dam on Musi and its tributaries.</p>\n<h2 id=\"mcetoc_1e2dc5qta2\">Chief Engineer</h2>\n<p>After this he was called by the Maharaja of Mysore and appointed as the Chief Engineer of the Mysore State. In 1912, the Krishnaraja Sagar Dam was built on the Kaveri River. Before the dam was built, the big British engineers had said that this dam cannot be built and crores of rupees will be wasted on it. With the construction of this dam, he got fame in the whole world.<br><br>In 1912, he was made the Diwan of the Kingdom of Mysore. He remained in the post of Diwan till 1918. During this period he started many industries and businesses there, among which Bhadravati's steel factory is notable. Established the University of Mysore in the field of education. It was the sixth university in India. People talk about their efficient and successful administration even today.<br><br>He was the first person to work on the planned economy in the country and on this subject he published his book Planned Economy for India. This was the first book of its subject published in India. He was later made the director of Tata Ispat, a post he held from 1927 to 1955.<br><br>At the age of about 90, he surprised the whole nation by constructing the Ganges bridge at Mokama near Patna. The entire country expressed respect for his merit, effort and amazing organization power. In this connection, Andhra Pradesh University in 1931, Kashi Hindu University in 1937, S.N. N. DT Women's University, Bombay and University of Mysore in 1948 awarded honorary titles.</p>\n<h2 id=\"mcetoc_1e2dc522t1\">Honors</h2>\n<p>The British Government of India honored him with the title of 'Sir'. On September 7, 1955, at the Rashtrapati Bhavan Delhi, the first President of independent India, Dr. Rajendra Prasad decorated him with the \"Bharat Ratna\". In 1958, the premier Royal Asiatic Society of Bengal honored him with the Durga Prasad Khaitan Gold Medal.<br><br>He died on April 14, 1962 after spending a full age of one hundred and one years with great respect and effort. Indian Engineers celebrate his birthday on 15 September every year as \"Engineers Day\" in the memory of this great Indian engineer.</p>",
            "image": "http://www.satyaknowledge.com/media/posts/17/Bharat-Ratna-Sir-Mokshagundam-Visvesvaraya.jpeg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-03-02T15:54:05+05:30",
            "date_modified": "2020-03-02T15:54:05+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/why-honesty-is-naked.html",
            "url": "http://www.satyaknowledge.com/why-honesty-is-naked.html",
            "title": "Why Honesty is naked?",
            "summary": "Our elders often teach us that we should always be honest, conduct truth, perform our duty and help the weak and poor. In fact, these are some moral beliefs, which we have considered to be very important for our lives and whose official practice we&hellip;",
            "content_html": "<p>Our elders often teach us that we should always be honest, conduct truth, perform our duty and help the weak and poor.<br><br>In fact, these are some moral beliefs, which we have considered to be very important for our lives and whose official practice we have been trying to do. The reason we have done this has been that we consider these moral beliefs to be a means of making our life happy and believe that without them human life becomes distorted and painful.<br><br>But on the contrary, when we see that those who live a life of untruth, cheating and dishonesty are not happy, but vice versa, then it becomes questionable that moral beliefs like truth, duty and honesty etc. should be given to us. Whether to base Because it is a matter of experience that every person in the world shows truth, truthfulness and honesty for goodness and it says that these should be the basis of our life.<br><br>But in actual practice, innumerable people appear to be giving up these ideals when they see that walking on them does not solve the real problems of life and people who do not care for them lead a more happy life in the world. Why do most people not accept truth and honesty? In this context, a story related to dishonesty and honesty is very relevant.</p>\n<h2 id=\"mcetoc_1e288nufp1\">Honesty and Dishonesty</h2>\n<p>It is said that once honesty and dishonesty went to bathe in a river. After taking off their clothes for bathing, both of them took a dip in the river with the race to take a long dip. Dishonesty came out of the water quickly due to its tendency and after wearing the clothes of honesty, went away from there.<br><br>When honesty later came out of the water and could not find her clothes on the banks of the river, she was confused because she did not want to be dishonest by wearing Dishonesty's clothes. In such a situation, he thought to be nude.<br><br>It is said that since then, honesty is naked and her clothes have been worn by Dishonesty. As a result, people who want to avoid nudity, adopt Dishonesty wearing honesty clothes and remain attuned to them as long as they can recognize the reality of Dishonesty. Because many problems of people are easily solved with the help of it.<br><br>According to the story, this is the reason that honesty has fallen alone in the world and there are very few people to adopt it; Whereas people who adopt dishonesty and live with it are numerous and they do not consider it bad but good.</p>",
            "image": "http://www.satyaknowledge.com/media/posts/16/plato-quote.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-02-29T16:20:36+05:30",
            "date_modified": "2020-02-29T16:20:36+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/how-to-avoid-evil.html",
            "url": "http://www.satyaknowledge.com/how-to-avoid-evil.html",
            "title": "How to avoid evil? - Great Thoughts",
            "summary": "The famous scholar Tacitus has said that \"As long as humans live, evil will remain.\" The greatest feature of evil is that it forces the holder to find his / her ambition elsewhere. As a result, no one is able to see their evils and&hellip;",
            "content_html": "The famous scholar Tacitus has said that \"As long as humans live, evil will remain.\"<br><br>The greatest feature of evil is that it forces the holder to find his / her ambition elsewhere. As a result, no one is able to see their evils and does not even try to remove them. As a result, he continues to provide the birth protection of his evildoer and his unrestrained side continues to be confirmed.<br><br>Per-dosha philosophy means that a person who is busy in seeing the evil of others, remains ignorant of the insects inside him towards his evil. This is why it is said that Dosh Darshan is the biggest flaw or evil But the situation is such that no one blames himself in 99 percent of situations, no matter how big his mistake is.<br><br>Swami Ramathirtha says that 'अपनी आँख में शहतीर देख पाने की अपेक्षा दूसरों की आँख में तिनका देख लेना सरल है.'<br><br>Therefore, we should first avoid the evil called dosha-darshan and the simple solution to this is that we should practice watching our evils. We will see that the evils that we see in other people are present in us. Saint Kabir Das has said that<br><br>बुरा जो देखन मैं चला, बुरा मिला न कोय । जो दिल खोजा आपना, मुझसा बुरा न कोय ॥<br><br>Therefore, if we know our evils and try to remove them one by one, we will do a lot of work in life and ourselves will also become a good and big person. As soon as we start looking towards our faults or our evils, as we start to consider others as bad and blame them for our sufferings.<br><br>A famous thinker has spoken of great importance in this context - \"Ordinary people blame each other for their evil.\"<br><br>Thinking of evil in any form casts a dark shadow on the mind. Clashes and discord arise due to the thought of evil or its discussion. The action of which karma results in discord and affliction, there is no benefit, but only loss. The best and best way to avoid evils is not to discuss them, and try to remove our evils one by one. Goods will be reputed by them in their spaces.<br><br>Acharya Vinoba Bhave has said that \"Bad things should be forgotten. If we keep looking at the bad things, then people will become cruel.\"<br><br>Benjamin Franklin has also said- \"Let your evils die before you.\"",
            "image": "http://www.satyaknowledge.com/media/posts/15/avoid-evil.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-02-28T18:23:51+05:30",
            "date_modified": "2020-02-28T18:23:51+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/study-in-england.html",
            "url": "http://www.satyaknowledge.com/study-in-england.html",
            "title": "Should You go to England to Study?",
            "summary": "It is natural for talented and talented students to have an ambition to get higher education in foreign universities and institutes. In the absence of sufficient information and proper guidelines, the idea of ​​getting education abroad from them seems like breaking stars from the sky,&hellip;",
            "content_html": "It is natural for talented and talented students to have an ambition to get higher education in foreign universities and institutes. In the absence of sufficient information and proper guidelines, the idea of ​​getting education abroad from them seems like breaking stars from the sky, but all this is not true.<br><br>Talented and promising students who are not very rich and want to pursue higher education abroad, can know the way forward for their future by learning about the feelings of scholarship in foreign universities and institutes. Come, give you some useful information in this subject, so that you too can fulfill your dream of getting higher education abroad.<br><br>The education system of India is very much in line with the education system of England. Apart from this, a large number of people of Indian origin are inhabited there. That's why Indian people often like to go to England more for studies and it is often that after completing their education most of the people also work there.<br><br>The same happens to Indians known for research and higher education. Perhaps this is the reason that a large number of engineers, doctors and other trained human resources working in England belong to people of Indian origin. There are some who really want to return home, but do not have the courage to end the facilities available in England, the social environment and the relationships of their children's British life in one stroke. Hence, even if the unsolicited get away from their motherland.<br><br>There are many types of misconceptions in England about the system of foreign students, especially Indian students, to get education. Like some people say that to get education in England, English language proficiency is necessary. In the opinion of such people, English is the most difficult in the UK and the level of English language is also important along with education there.<br><br>There is no obstacle for students studying in convent or other public schools in India, but students studying through Hindi medium must face many difficulties there.<br><br>There are a total of 47 universities and institutes for higher education in England, many of which provide scholarships to foreign students by providing scholarships. Apart from this, there are also scholarships from Commonwealth countries and the British Council.<br><br>In universities here, applications for admission to postgraduate level courses are accepted through the Education Officer of the Indian Embassy in UK.",
            "image": "http://www.satyaknowledge.com/media/posts/14/study-in-england.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-02-28T18:13:49+05:30",
            "date_modified": "2020-02-28T18:47:46+05:30"
        },
        {
            "id": "http://www.satyaknowledge.com/historical-facts-about-kashmir-issue.html",
            "url": "http://www.satyaknowledge.com/historical-facts-about-kashmir-issue.html",
            "title": "Historical Facts about Kashmir Issue",
            "summary": "Today no one can deny the historical fact that the Kashmir problem was born due to the wrong decisions of Pt. Jawaharlal Nehru, the first Prime Minister of India. When the British Government passed the Indian Independence Act 1947 to liberate Hindustan, it gave the&hellip;",
            "content_html": "<p>Today no one can deny the historical fact that the Kashmir problem was born due to the wrong decisions of Pt. Jawaharlal Nehru, the first Prime Minister of India. When the British Government passed the Indian Independence Act 1947 to liberate Hindustan, it gave the right to join or remain independent in India or Pakistan, which ruled by the King Maharajas.</p>\n<h2 id=\"mcetoc_1e23dv7sq2\">Maharaja Harisingh</h2>\n<p>As a result, at that time, Maharaja Harisingh of Jammu and Kashmir refused to join India or Pakistan and announced that he would compromise with both countries - Pakistan and Hindustan - by remaining independent. On 14 August 1947, Pakistan was declared and India became independent on 15 August 1947.<br><br>Pakistani rulers have since forced Maharaja Harisingh to merge Jammu and Kashmir with Pakistan, but when they were not ready for it, he first made an economic blockade of Janmu-Kashmir and then made a confession on October 22, 1947. Suddenly attacked the state under cover.<br><br>Two days after the Pakistani attack on Jammu and Kashmir, on 24 October 1947, Maharaja Harisingh declared an unconditional merger of Jammu Kashmir with India and asked for military assistance from India, but since India had no air service at the time, Army sent to Kashmir by private air services ships by Nehru government. In doing so, it took 3 days for the Indian Army to reach Kashmir and as a result, in these five days, Pakistani forces got the opportunity to wreak havoc in the state to a great extent.<br><br>Jammu and Kashmir became a legal part of India on 27 October 1947 after Maharaja Harisingh accepted the merger proposal. But the Nehru government nevertheless assured that upon the establishment of peace, the desire of the people of the state to meet in India or Pakistan would be ascertained.<br><br>If seen from the perspective of today, the Nehru government was a huge mistake like the Himalayas. After this, a wrong decision was made that even after the merger was completed in terms of law, Article 370 was added to the Constitution of India and gave Kashmir a separate status from other states of India. Sheikh Abdullah was made Prime Minister and Harisingh's son Karn Singh was made Sadar princely state by removing Maharaja Harisingh from the throne.</p>\n<h2 id=\"mcetoc_1e23du6q20\">Sardar Patel opposes this</h2>\n<p>Sardar Patel, opposing this, suggested that the refugees who had come to desolate from Pakistan should be settled in Jammu and Kashmir. But Sheikh Abdullah was not ready for this, so even Pt. Nehru did not like it. It would be ironic that on the basis of Maharaja Harisingh's proposal, even after the merger of Kashmir with India was completed, under Article 370 of the Constitution, Kashmir maintained a separate existence from other states.<br><br>Can a country have two legislations, two marks and two heads? India was the first country in the world where this happened. The flag of Jammu Kashmir is different till date. As long as Sheikh Abdullah remained in power, he was called Prime Minister, while all other states had chief ministers. All the states of the country had governors, Kashmir alone was a princely state.<br><br>Not only this, the citizens of India could not go to Kashmir without a visa and the decisions of the Supreme Court of India were also not applicable there. All these things gave the world an opportunity to understand and believe that Kashmir is different from India. Another major mistake of Pandit Nehru was that he took the attack of Pakistan to the United Nations, due to which he is still undecided.</p>",
            "image": "http://www.satyaknowledge.com/media/posts/10/kashmir-issue.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-02-27T19:10:30+05:30",
            "date_modified": "2020-02-27T19:36:24+05:30"
        }
    ]
}
