{
    "version": "https://jsonfeed.org/version/1",
    "title": "Satya Knowledge",
    "description": "",
    "home_page_url": "http://www.satyaknowledge.com",
    "feed_url": "http://www.satyaknowledge.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Narender Singh"
    },
    "items": [
        {
            "id": "http://www.satyaknowledge.com/cosmopolitanism-instead-of-patriotism.html",
            "url": "http://www.satyaknowledge.com/cosmopolitanism-instead-of-patriotism.html",
            "title": "Cosmopolitanism instead of Patriotism",
            "summary": "Today the world is sitting on the volcano of world destruction. Mankind has firmly confirmed its apocalypse. Molecule bombs, atomic bombs, cobalt bombs, hydrogen bombs and biological bombs guarantee the death of all living organisms on Earth today. We have made 'guided' missiles, but we&hellip;",
            "content_html": "Today the world is sitting on the volcano of world destruction. Mankind has firmly confirmed its apocalypse. Molecule bombs, atomic bombs, cobalt bombs, hydrogen bombs and biological bombs guarantee the death of all living organisms on Earth today.<br><br>We have made 'guided' missiles, but we ourselves are becoming missguided. Today, the world's defense expenditure has reached about 2 billion dollars annually. Around 2 crore people are engaged in military and 200 million people are engaged in semi-military operations.<br><br>The starvation prevailing in the world can be eliminated with only one percent contribution of this huge expenditure. The world government is absolutely essential to end the blind race for justice and armament of this forest.<br><br>Today, the world is in the grip of economic inequality. On the other hand, 15% of the developed population of the world is spending 60% of the total world income on opulence and luxury, on the other hand, the people of the developing countries are forced to live an animal life. The future of their children is dark. Far from education and employment, basic amenities like food, clothing and housing are not available to them.<br><br>Kalahandi district of Odisha lost many lives due to non-availability of drinking water. Similarly, in 1987, hundreds of people in Kenya (Africa) fell victim to starvation. By controlling these economic inequalities through the World Government, basic amenities can be made available to the world public. Similarly, through the world government, the prevailing caste-discrimination, apartheid and autocratic and autocratic rule in the world can be completely destroyed.<br><br>Many scholars envisaged world government from time to time. Among them are Henry IV, William Penn, Emerick Krause, Pierre Dubi, Kant, Russo, Mahatma Gandhi, Sarvepalli Dr. Radhakrishnan, etc. In 1919, Clarence Street mentioned the world government in the second chapter of his book 'Union Now'.<br><br>In this way, Arnold Tynby in his book, 'Have Man a Future', has formed the administrative, executive and judiciary of the world government. The simplest and most practical way to form a world government is to develop the United Nations into a world government. Accepting its federal form, the General Assembly should be given the shape of the World Parliament, the Security Council as the World Executive and the International Court as the World Court.<br><br>Also, in order to make the world government successful and effective, it is necessary that all nations limit their sovereignty and make the world government sovereign. They should hand over the responsibility of their unity and integrity to him. All nations should think above the narrow mindset of language, religion, caste and community and propagate cosmopolitanism instead of patriotism in the country.",
            "image": "http://www.satyaknowledge.com/media/posts/1/cosmopolitanism-instead-of-patriotism.jpg",
            "author": {
                "name": "Narender Singh"
            },
            "tags": [
            ],
            "date_published": "2020-02-23T20:54:49+05:30",
            "date_modified": "2020-02-23T20:54:49+05:30"
        }
    ]
}
